{
    "operation":[
        {
            "name":"rectangle",
            "displayname": "rectangle",
            "description":"Generates an unfilled rectangle of the size defined by the parameters. If given an input, the rectangle fills with the input.",
            "application": "Creating a rectangle that is the width of the cloth (total ends) and height of your pattern repeat (total pics) and inputting a generated draft is an easy way to repeat a draft or pattern across the width of your cloth. Rectangles can be joined together as bars, tiles, and layers using operations under “combine”."
        },

        {
            "name":"clear",
            "displayname": "clear",
            "description": "Converts all the interlacements in the input draft to be raised.",
            "application": "Often used when masking one draft with another, this defines an entire region as black cells, allowing them to function as a masking region" 
        },
        {
            "name":"set unset",
            "displayname": "set unset interlacements to...",
            "description": "Sets all unset interlacements/cells in this draft to the value set in the parameter.",
            "application": "Unset cells allows someone to describe shape or inlay elements in a cloth. Set unset can control if interlacements outside that region are interpreted as warp lifts or lowers. " 
        },
        {
            "name":"set down to unset",
            "displayname": "set interlacements of type to unset...",
            "description": "This sets all interlacements of a particular type (e.g. raised or lowered) in the input draft to unset",
            "application": "Unset cells allows someone to describe shapeed or inlay elements in a cloth. Set interlacements of one type to unset will have the effect of specifying an area where no weft will travel" 
        },
        {
            "name":"set down to unset",
            "displayname": "set interlacements of type to unset...",
            "description": "This sets all interlacements of a particular type (e.g. raised or lowered) in the input draft to unset",
            "application": "Unset cells allows someone to describe shapeed or inlay elements in a cloth. Set interlacements of one type to unset will have the effect of specifying an area where no weft will travel" 
        },
        {
            "name":"apply materials",
            "displayname": "set materials and systems",
            "description": "Adds information to the draft that represents the materials and warp- and weft-systems that will be associated with the draft",
            "application": "Complex weavers often generate structures that consider each warp and weft as a logical system that will behave differently in different regions of the cloth. Thus, some operations, like layer notation, require systems to be specified in order to compute complex structures that obey the systems of warps and wefts over the cloth. Applying materials allows one to visualize the relationship between the draft and the color effects visible on the cloth's surface" 
        },
        {
            "name":"invert",
            "displayname": "invert",
            "description": "Inverts the draft so that raised warp ends become weft picks and weft pics become raised warp ends.",
            "application": "Swaps the faces of the cloth, moving the front to back and back to front." 
        },
        {
            "name":"flip horiz",
            "displayname": "flip horiz",
            "description": "Generates an output draft that mirrors the input draft from left to right.",
            "application": "Can be used to create structures that include rotations of a basic motif" 
        },
        {
            "name":"shift left",
            "displayname": "shift left",
            "description": "Generates an output that is shifted to the left by the number of warp ends specified in the parameters.",
            "application": "Creates a version of a draft that is structurally identical, but has the placement of interlacements fine tuned in relation to other structures" 
        },
        {
            "name":"shift up",
            "displayname": "shift up",
            "description": "Generates an output that is shifted upward by the number of pics specified in the parameters.",
            "application": "Creates a version of a draft that is structurally identical, but has the placement of interlacements fine tuned in relation to other structures" 
        },
        {
            "name":"flip vert",
            "displayname": "flip vert",
            "description": "Generates an output draft that mirrors the input draft from top to bottom.",
            "application": "Can be used to create structures that include rotations of a basic motif" 
        },
        {
            "name":"slope",
            "displayname": "slope",
            "description": "Shifts every nth pic by the vaule given in ends",
            "application": "We do not know of an existing reason, but essentially slants the input draft, which can be fun" 
        },
        {
            "name":"rotate",
            "displayname": "rotate",
            "description": "Generates an output draft that is the same as the input draft, but rotated by the amount specified",
            "application": "To create patterns and motifs that involve a rotated element" 
        },
        {
            "name":"makesymmetric",
            "displayname": "make symmetric",
            "description": "Rotates and 'stamps' the input draft around a corner, creating rotational symmetry around the selected point according to the parameters described below.",
            "application": "to create structures with rotational symmetry" 
        },
        {
            "name":"interlace",
            "displayname": "interlace wefts",
            "description": "Creates a new draft by taking one pic from each input and assigning them to sucessive pics in the output draft.",
            "application": "Combines two structures into a compound structure. For instance, for overshot, you might interlace a tabby into a floating structure, the alteranting tabby pics would add structure, the floats would add surface color and texture" 
        },
        {
            "name":"splice in wefts",
            "displayname": "splice in pics",
            "description": "Splices the pics of the second input draft into the first. You can use the parameters to describe if you want the entire draft spliced in, or to splice the draft in pic by pic and the amount of pics between each insertion.",
            "application": "Can be used when you need to insert a material with a certain property (say elastic) even so many pics to control the level of stretch. Alterantively, pics can be inserted to bind layers together" 
        },
        {
            "name":"splice in warps",
            "displayname": "splice in ends",
            "description": "Splices the ends of the second input draft into the first. You can use the parameters to describe if you want the entire draft spliced in, or to splice the draft in end by end and the amount of ends between each insertion.",
            "application": "Warp-wise splicing can be used to add a specific textual feature to the length of the cross in even intervals" 
        },
        {
            "name":"notation",
            "displayname": "layer notation",
            "description": "Developed in collaboration with Kathryn Walters, this operation uses a notation system to assign drafts to different warp and weft patterns on different layers of cloth. Layers are represented by () so (1a)(2b) puts warp 1 and weft a on layer 1, warp 2 and weft b on layer 2.",
            "application": "This is used to create differetn structures, with different layer relationships, across an entire cloth. It becomes especially powerful with one changes layer numbers. For example (a1b2)(c2) will place the first layer across two systems, and the second layer across one system. This means that one can arbitrary change both layer order, as well as the association of different warp and weft systems to different layers across different regions of the cloth.", 
            "dynamic":"true"
        },
        {
            "name":"layer",
            "displayname": "layer",
            "description": "Creates a draft in which each input is assigned to a layer in a multilayered structure. Assigns the first input to the top layer and so on.",
            "application": "To arrange different structures on different layers" 
        },
        {
            "name":"assignlayers",
            "displayname": "assign drafts to layers",
            "description": "Assigns one or more drafts to layers of cloth, defined by the parameters described below, using inputs that can also be assigned to weft systems.",
            "application": "To arrange different structures on different layers, while determining the ordering of systems across layers",
            "dynamic": "true"
        },
        {
            "name":"veritcal cut",
            "displayname": "warp-wise cut",
            "description": "Creates two drafts with two systems, one representing the input draft on left side of the cloth and the other representing the right side",
            "application": "To create an opening, perhaps for a pocket, one can weave with two different shuttles on different pics, each of which travels part way across the cloth" 
        },
        {
            "name":"selvedge",
            "displayname": "selvedge",
            "description": "Adds a selvedge of so many ends on both sides of the input draft, 'draft.' The second input, 'selvedge,' determines the selvedge pattern, and if none is given, a selvedge is generated.",
            "application": "Adding selvedges to the sides of the cloth maintains clean edges" 
        },
        {
            "name":"overlay",
            "displayname": "overlay, (a,b) => (a OR b)",
            "description": "Applies binary math to two drafts. To do so, it looks at each interlacement in input drafts a and b. If either interlacement a or b are marked as warp lifted, the resulting draft will have a warp raised in that location. ",
            "application": "No esablished application, but a fun way to see how to apply binary math to the production of drafts. Retains the pattern of raised warp ends (black cells) from each input draft when they are overlaid. (Keeps any region that is marked black/true in either draft)" 
        },
        {
            "name":"atop",
            "displayname": "set atop, (a, b) => b",
            "description": "Applies binary math to two drafts. To do so, it looks at each interlacement in input drafts a and b. If a is marked warp raised and b marked warp lowered, or vice versa, it sets the corresponding interlacement in the output draft to warp raised.",
            "application": "No esablished application, but a fun way to see how to apply binary math to the production of drafts." 
        },
        {
            "name":"knockout",
            "displayname": "knockout, (a, b) => (a XOR b)",
            "description": "Applies binary math to two drafts. To do so, it looks at each interlacement in input drafts a and b and copies the interlacement in a where a is present",
            "application": "No esablished application, but a fun way to see how to apply binary math to the production of drafts." 
        },
        {
            "name":"mask",
            "displayname": "mask, (a,b) => (a AND b)",
            "description": "Applies binary math to two drafts. To do so, it looks at each interlacement in input drafts a and b  If a is marked warp raised and b marked warp raised, it sets the corresponding interlacement in the output draft to warp raised. Otherwise, the interlacement is marked warp lowered. This effectively masks draft a with draft b",
            "application": "No esablished application, but a fun way to see how to apply binary math to the production of drafts. Retains input draft b in regions where input draft a has raised warp ends (black cells); draft b is only retained within the area of draft a." 
        },
        {
            "name":"sine",
            "displayname": "sine wave sample",
            "description": "Samples a sine wave at a rate specified by the the interval parameter, and stretches the wave to the size of amplitude. Converts this wave to a draft by marking a warp raised in any location where the wave is present",
            "application": "No esablished application, but an interesting way to create threadings and threadlings for interesting looking drawdowns"
        },
        {
            "name":"sawtooth",
            "displayname": "sawtooth",
            "description": "Creates a sawtooth pattern (e.g. mountain/valley zigzag) of a user specified width with a user specified number of teeth in the sawtooth as described by the segments parameter",
            "application": "Can be used to generated pointed threadings and treadlings" 
        },
        {
            "name":"fill",
            "displayname": "fill",
            "description": "Fills black cells of the first input, “pattern,” with the draft specified by the second input, and the white cells with draft specified by the third input.",
            "application": "Fill can be used to create graphic regions on cloth. For instance, the input draft can contain a simple graphic drawn in black/warp raised cells, the fill operation then, can fill the black cells with a structure, such as a shaded satin, so that the heart is visible and well structured on the resulting cloth." 
        },
        {
            "name":"tabbyder",
            "displayname": "tabby",
            "description": "Also known as plain weave. Plain weave is one of the most basic weave structures in which each weft thread passes over one warp end and under one warp end; the next weft pick follows the pattern on the alternate warp threads (over/under/over/under). Tabby variations include basket weave, rib weave, and rep weave. These dervicatives can be generated by modifying the parameters",
            "application": "Generates a tabby or tabby derivative structure that can be modified as needed as ones design evolves." 
        },
        {
            "name":"twill",
            "displayname": "twill",
            "description": "In this context, a complex twill is a straight twill with multiple ratios of interlacement in a single structure unit so that a 2 2 3 3 pattern describes a structure with two raised warp ends, two lowered ends, three raised ends, and three lowered ends. Each successive pic begins the same pattern of interlacement on an adjacent warp end, creating a diagonal pattern.",
            "application": "Generates a twill or twill derivative structure that can be modified as needed as ones design evolves." 
        },
        {
            "name":"waffle",
            "displayname": "waffle-ish",
            "description": "Waffle weave is a twill-based structure in which warp and weft floats of increasing and then decreasing lengths are bound by a border of tabby interlacements to create a grid of cells. There is typically an equal number of pics and ends in a single pattern unit. This operation generates waffle-type structures, but also creates something strange when given uneven pics and ends, or more than one border of tabby interlacements",
            "application": "Generates a waffle or waffle-inspired structure that can be modified as needed as ones design evolves." 
        },
        {
            "name":"complextwill",
            "displayname": "complex twill",
            "description": "Twill is a family of weave structures in which weft picks pass over or under one or more warp threads in a repeating pattern (i.e. 1/3, 2/2, or 3/1). The same interlacement sequence begins on an adjacent warp end, either to the left or right, in the next weft row, creating a diagonal pattern of interlacement.",
            "application": "Generates a complex twill structure that can be modified as needed as ones design evolves." 
        },
        {
            "name":"satin",
            "displayname": "satin",
            "description": "Satin is a family of weave structures that create cloth with weft floats on one face of the fabric and warp floats on the other. The succeeding interlacements of warp and weft threads in each row occur on non-adjacent warp threads, creating a smooth surface of floating threads on each face. The number of ends between succeeding warp interlacements is consistent in each row (i.e. a 1/8 satin will have one raised warp end followed by a weft float over 8 warp ends in each row).",
            "application": "Generates a satin structure that can be modified as needed as ones design evolves." 
        },
        {
            "name":"shaded_satin",
            "displayname": "shaded satin",
            "description": "Satin is a family of weave structures that create cloth with weft floats on one face of the fabric and warp floats on the other. The succeeding interlacements of warp and weft threads in each row occur on non-adjacent warp threads, creating a smooth surface of floating threads on each face. The number of ends between succeeding warp interlacements is consistent in each row (i.e. a 1/8 satin will have one raised warp end followed by a weft float over 8 warp ends in each row). Shaded satins typically use more than just one raised warp on each pic to control the visiblity of the warp or weft colors proportionally",
            "application": "Generates a satin or shaded satin structure that can be modified as needed as ones design evolves." 
        },
        {
            "name":"random",
            "displayname": "random",
            "description": "Generates a draft of the size specified where the value of each interlacement is generated randomly.",
            "application": "We don't know of current random draft generators, so this one is just for the fun of applying code-based random number generators to weaving structures" 
        },
        {
            "name":"combos",
            "displayname": "all possible structures",
            "description": "This structure operation was prompted by a question from weaver and AdaCAD collaborator Marianne Fairbanks who wanted to implement an algorithm to find every possible structure for an N x N draft. The motivation was largely based on the observance that three structures are said to be the core of all weaving: satin, twill and tabby. M wanted to know why these three? What other options were there? And what might be possible in these other options. This algorithm revealed that there are 102 possible 3x3 structures and 22874 possible 4x4 structures (though some structures are rotations, reflections, and shifts of others, leading us to questions of definition of equivalency in structures).",
            "application": "Allows one to systematically explore all possible drafts, just for the sake of it" 
        },
        {
            "name":"stretch",
            "displayname": "stretch",
            "description": "Repeats each warp and/or weft by the values given in the parameters.",
            "application": "Most often, stretch can be used to resize a structure to ensure that it weaves square" 
        },
        {
            "name":"resize",
            "displayname": "resize",
            "description": "Stretches or compresses the draft to fit the boundary defined by the values given in the parameters. It does so by adding or removing whole pics and ends every in constent intervals.",
            "application": "Resize can help one convert artwork to a boundary size different then what was originally intended. We suggest playing with the boundary size until the resize generates a desirable draft" 
        },
        {
            "name":"margin",
            "displayname": "add margins",
            "description": "When the second inlet is unfilled, it adds a margin of unset threads to the top, right, bottom, and/or left. If the second inlet has a draft, the margin is filled with the pattern of the draft specified",
            "application": "Adds borders of a given structure to rectangular blocks, perhaps to maintain consistent packing as one samples various structures across the width of the cloth." 
        },
        {
            "name":"crop",
            "displayname": "crop",
            "description": "Crops the structure or pattern to a region of the input draft. The crop size and placement are defined by the parameters",
            "application": "To pick a section out of a draft that you might want to modify" 
        },
        {
            "name":"trim",
            "displayname": "trim",
            "description": "Trims off the edges of an input draft according to the parameters described below.",
            "application": "Can be used to trim off the edges of the draft that might not repeat nicely" 
        },
        {
            "name":"warp_profile",
            "displayname": "pattern across width",
            "description": "Given a series of letters (a b c), this operation will associate a draft with each letter, and then arrange those drafts from left to right following the pattern order ",
            "application": "Can be used for profile drafting and describing repeating patterns across the cloth.",
            "dynamic":"true"

        },
        {
            "name":"weft_profile",
            "displayname": "pattern across length",
            "description": "Given a series of letters (a b c), this operation will associate a draft with each letter, and then arrange following the pattern order ",
            "application": "Can be used for profile drafting and describing repeating patterns along the length the cloth.",
            "dynamic":"true"

        },
        {
            "name":"sample_width",
            "displayname": "variable width sampler",
            "description": "Given a series of letters and numbers (a100 b200 c300), this operation will associate a draft with each letter, and then arrange those drafts from left to right following the pattern order. The numbers next to each letter describe the number of ends upon which the specified pattern should be repeated",
            "application": "Can be used for creating several sample swatches across the width of the cloth",
            "dynamic":"true"

        },
        {
            "name":"sample_length",
            "displayname": "variable length sampler",
            "description": "Given a series of letters and numbers (a100 b200 c300), this operation will associate a draft with each letter, and then arrange those drafts following the pattern order. The numbers next to each letter describe the number of pics upon which the specified pattern should be repeated",
            "application": "Can be used for creating several sample swatches across the length of the cloth",
            "dynamic":"true"

        },
        {
            "name":"tile",
            "displayname": "tile",
            "description": "Repeats the input block along the warp and weft according to the parameters described below.",
            "application": "Can be used to repeat a pattern across the cloth a specified number of times"
        },
        {
            "name":"chaos",
            "displayname": "chaos sequence",
            "description": "Made in collaboration Jacqueline Wernimont, Molly Morin and Nikki Stevens. Tiles the input drafts, randomly selecting which draft to place at which position",
            "application": "No specific application, just creates some nice tilings",
            "youtube":"kQWCOMvLNqk"
        },
        {
            "name":"bind weft floats",
            "displayname": "bind weft floats",
            "description": "Adds interlacements to weft floats over the user specified length",
            "application": "To automatically find and bind long floats in a design"
        },
        {
            "name":"bind warp floats",
            "displayname": "bind warp floats",
            "description": "Adds interlacements to warp floats over the user specified length",
            "application": "To automatically find and bind long floats in a design"

        },
        {
            "name":"erase blank rows",
            "displayname": "erase blank rows",
            "description": "Erases any rows that are entirely unset.",
            "application": "Blank rows can emerge when working across multiple systems. Erasing blank rows, then, can speed up weaving by avoiding picing blank rows"

        },
        {
            "name":"join top",
            "displayname": "join top",
            "description": "Joins drafts assigned to the drafts input together from bottom to top.",
            "application": "To arrange different structures across rows"

        },        
        {
            "name":"join left",
            "displayname": "join left",
            "description": "Joins drafts assigned to the drafts input together from left to right.",
            "application": "To arrange different structures across columns"

        },
        {
            "name":"dynamicjoinleft",
            "displayname": "subdivide width",
            "description": "Subdivides the width (number of ends) of the draft into equal-sized sections, then, takes each input draft and assigns it a division from left to right.",
            "application": "Simplifies the ability to evenly split structures, side by side, across a particular number of ends",
            "dynamic":"true"

        },
        {
            "name":"dynamicjointop",
            "displayname": "subdivide length",
            "description": "Subdivides the length (number of pics) of the draft into equal-sized sections, then, takes each input draft and assigns it a division",
            "application": "Simplifies the ability to evenly split structures, one ontop of another, across a particular number of pics",
            "dynamic":"true"

        },
        {
            "name":"bwimagemap",
            "displayname": "upload draft",
            "description": "Uploads a draft from an image into AdaCAD",
            "application": "To upload drafts from other sources into the workspace"

        },
        {
            "name":"imagemap",
            "displayname": "image map",
            "description": "Uploads an image and creates an input for each color found in the image. Assigning a draft to the color fills the color region with the selected draft.",
            "application": "Can be used to create complex woven motifs or images with regions filled with different structures",
            "dynamic":"true"

        },
        {
            "name":"germanify",
            "displayname": "germanify",
            "description": "Uses machine learning to edit the input draft based on common patterns found in a set of German Weave drafts.",
            "application": "No particular application, just curious"
        },
        {
            "name":"crackle-ify",
            "displayname": "crackle-ify",
            "description": "Uses machine learning to edit the input draft based on common patterns found in a set of Crackle Weave drafts.",
            "application": "No particular application, just curious"
        },
        {
            "name":"direct loom",
            "displayname": "generate direct tie loom threading and lift plan",
            "description": "Uses the input draft as drawdown and generates a threading and lift plan pattern",
            "application": "To create threading and treadlings plans from drawdowns"
        },
        {
            "name":"floor loom",
            "displayname": "generate floor loom threading and treadling",
            "description": "Uses the input draft as drawdown and generates a threading and lift plan pattern",
            "application": "To create threading and treadlings plans from drawdowns"
        },
        {
            "name":"drawdown",
            "displayname": "make drawdown from threading, tieup, and treadling",
            "description": "Create a drawdown from the input drafts (order 1. threading, 2. tieup, 3.treadling)",
            "application": "To create drawdown from from a floor loom plan"
        },
        {
            "name":"directdrawdown",
            "displayname": "make drawdown from threading and lift plan",
            "description": "Create a drawdown from the input drafts (order 1. threading, 2. tieup, 3.lift plan)",
            "application": "To create drawdown from from a direct loom plan"
        }


   
       
    ],

    "param": [
        {
            "name":"ends",
            "description": "the number of warp ends to use in the resulting draft"
        },
        {
            "name":"pics",
            "description": "the number of weft pics to use in the resulting draft"
        },
        {
            "name":"raised/lowered",
            "description":"toggles interlacements between selecting warp raised or warp lowered"
        },
        {
            "name":"calculate repeats",
            "description":"automatically repeats the input drafts by the amount neccessary to ensure that each draft repeats in even intervals"
        },
        {
            "name":"shift ends",
            "description":"shifts the draft a certain number of ends"
        },
        {
            "name":"shift pics",
            "description":"shifts the draft a certain number of pics"
        },
        {
            "name":"warps raised",
            "description":"the number of warp ends to have lifted in the first pic"
        },
        {
            "name":"warps lowered",
            "description":"the number of warp ends to keep lowered in the first pic"
        },
        {
            "name":"S/Z",
            "description":"defines the direction of the sequential pattern shift"
        },
        {
            "name":"facing",
            "description":"toggle the warps raised and lowered so that the structure is more warp-facing or weft-facing."
        }



    ],

    "dynamic_description":"This is a dyanmic operation, meaning that one of the parameters generates multiple 'inlets' to the function. Changing that parameter adds or changes the number of inlets). Each inlet can accept a draft and associate a particular value with that draft. " 

    


}